buzzwang1/pcb/source/Data/DateTime/Clock/v00.00.03/_var/STM32L4/cClock.h
#ifndef _CCLOCK_H
#define _CCLOCK_H

#include "typedef.h"
#include "CStrT.h"
#include "ClockInfo.h"
#include "cWufHandler.h"
#include "cBuRam.h"

#ifdef __cplusplus
extern "C" {
#endif

#include "stm32l433xx.h"
#include "stm32l4xx_hal.h"
#include "stm32l4xx_ll_bus.h"
#include "stm32l4xx_ll_rcc.h"
#include "stm32l4xx_ll_system.h"
#include "stm32l4xx_ll_rtc.h"
#include "stm32l4xx_ll_pwr.h"


class cClock
{
  public:

  typedef struct
  {
    uint8  ui8Hour;
    uint8  ui8Minute;
    uint8  ui8Second;
    uint8  ui8SubSecond;
  } tstTime;


  typedef union
  {
    uint32  ui32Time;
    tstTime stTime;
  }tunTime;

  typedef struct
  {
    uint16 ui16Year;
    uint8  ui8Month;
    uint8  ui8Day;
  } tstDate;

  typedef union
  {
    uint32  ui32Date;
    tstDate stDate;
  }tunDate;

  typedef struct
  {
    tunDate  unDate;
    tunTime  unTime;
  } tstTimeDate;

  tunTime mTime;
  tunDate mDate;
  tstTimeDate mLastSync;
  tstTimeDate mLastSyncAttempt;

  u8      mValid;

  u8      mu8ClockSource; // 0 = no; 1 = LSE, 2 = LSI

  u8      mu8WaitForLse_s;

  static const uint8 nMonthTable[12];

  cClock(bool lbInit = True)
  {
    if (lbInit) vInit();
  }

  void vInit()
  {
    mu8ClockSource  = 0;
    mu8WaitForLse_s = 0;

    cBuRam::vEnable();

    bool lu8Reset = False;
    if ((cWufHandler::munWakeupSources.stWakeupSources.isWuPinRst) ||
        (cWufHandler::munWakeupSources.stWakeupSources.isWuSftRst)) lu8Reset = True;

    // Clock valid ?
    if ((cBuRam::mBuRam->u32RtcSyncCnt != 0) && (!lu8Reset))
    {
      vReadFromRtc();
      mValid = 1;
    }
    else
    {
      vRtcInit();
    }

    vGetClockSource();

    mLastSync.unDate.ui32Date = cBuRam::mBuRam->u32RtcSyncDate;
    mLastSync.unTime.ui32Time = cBuRam::mBuRam->u32RtcSyncTime;
    mLastSyncAttempt.unDate.ui32Date = cBuRam::mBuRam->u32RtcSyncAttmptDate;
    mLastSyncAttempt.unTime.ui32Time = cBuRam::mBuRam->u32RtcSyncAttmptTime;
  }

  void vClear()
  {
    mValid = 0;
  }


  void vRtcInit()
  {
    // --------------- First try LSE ---------------

    // BURAM vor dem Löschen sichern
    u32 lu32Backup[32];
    for (u8 lu8Idx = 0; lu8Idx < 32; lu8Idx++)
    {
      lu32Backup[lu8Idx] = ((u32*)(RTC_BASE + 0x50))[lu8Idx];
    }

    /*##-2- Configure LSE/LSI as RTC clock source ###############################*/
    // RTC_CLOCK_SOURCE_LSE
    // Löscht BuRam und RTC-Status, z.B. Wakeup
    // Once the RTC clock source has been selected, it cannot be changed any more unless
    // the Backup domain is reset.The BDRST bit can be used to reset them.
    LL_RCC_ForceBackupDomainReset();
    LL_RCC_ReleaseBackupDomainReset();

    LL_RCC_LSE_Enable();

    // BURAM nach dem Löschen restaurieren.
    for (u8 lu8Idx = 0; lu8Idx < 32; lu8Idx++)
    {
      ((u32*)(RTC_BASE + 0x50))[lu8Idx] = lu32Backup[lu8Idx];
    }

    // tSU(LSE)(3) Startup time VDD is stabilized: 2s
    // t SU(LSE) is the startup time measured from the moment it is enabled (by software) to a stabilized 32.768 kHz oscillation is
    // reached. This value is measured for a standard crystal and it can vary significantly with the crystal manufacturer
    if (LL_RCC_LSE_IsReady())
    {
      vRtcInit2();
    }
    else
    {
      mu8WaitForLse_s = 10;
    }
    vGetClockSource();
  }


  void vRtcInit2()
  {
    if (LL_RCC_LSE_IsReady())
    {
      LL_RCC_SetRTCClockSource(LL_RCC_RTC_CLKSOURCE_LSE);

      /*##-3- Enable RTC peripheral Clocks #######################################*/
      /* Enable RTC Clock */
      LL_RCC_EnableRTC();

      LL_RTC_InitTypeDef lstRtc;
      LL_RTC_StructInit(&lstRtc);

      lstRtc.HourFormat = LL_RTC_HOURFORMAT_24HOUR;

      // 32768 = 256*128
      // ck_apre = LSEFreq / (ASYNC prediv + 1) = 256Hz
      // ck_apre = 32768Hz / (127 + 1)          = 256Hz
      lstRtc.AsynchPrescaler = ((uint32_t)0x7F);

      // ck_spre = ck_apre / (SYNC prediv + 1) = 1 Hz
      // ck_spre = 256Hz   / (255 + 1)         = 1 Hz
      lstRtc.SynchPrescaler = ((uint32_t)0x00FF);
      LL_RTC_Init(RTC, &lstRtc);
    }
    else
    {
      LL_RCC_LSE_Disable();

      LL_RCC_LSI_Enable();
      while (LL_RCC_LSI_IsReady() != 1)
      {
      }
      LL_RCC_SetRTCClockSource(LL_RCC_RTC_CLKSOURCE_LSI);

      /*##-3- Enable RTC peripheral Clocks #######################################*/
      /* Enable RTC Clock */
      LL_RCC_EnableRTC();

      LL_RTC_InitTypeDef lstRtc;
      LL_RTC_StructInit(&lstRtc);

      lstRtc.HourFormat = LL_RTC_HOURFORMAT_24HOUR;


      // 32768 = 256*125
      // ck_apre = LSEFreq / (ASYNC prediv + 1) = 256Hz
      // ck_apre = 32768Hz / (124 + 1)          = 256Hz
      lstRtc.AsynchPrescaler = ((uint32_t)0x7C);

      // ck_spre = ck_apre / (SYNC prediv + 1) = 1 Hz
      // ck_spre = 256Hz   / (255 + 1)         = 1 Hz
      lstRtc.SynchPrescaler = ((uint32_t)0x00FF);
      LL_RTC_Init(RTC, &lstRtc);
    }
    vGetClockSource();
    mTime.ui32Time = 0;
    mDate.ui32Date = 0;

    mValid = 0;
  }

  void vGetClockSource()
  {
    // 0 = LL_RCC_RTC_CLKSOURCE_NONE
    // 1 = LL_RCC_RTC_CLKSOURCE_LSE
    // 2 = LL_RCC_RTC_CLKSOURCE_LSI
    // 3 = LL_RCC_RTC_CLKSOURCE_HSE_DIV32

    switch (LL_RCC_GetRTCClockSource())
    {
      case LL_RCC_RTC_CLKSOURCE_LSE:       mu8ClockSource = 1; break;
      case LL_RCC_RTC_CLKSOURCE_LSI:       mu8ClockSource = 2; break;
      case LL_RCC_RTC_CLKSOURCE_HSE_DIV32: mu8ClockSource = 3; break;
      default: mu8ClockSource = 0; break;
    }
  }

  bool isInit()
  {
    return (mu8WaitForLse_s == 0);
  }

  void vWriteToRtc()
  {
    if (!isInit()) return;

    LL_RTC_DateTypeDef lstDate;
    LL_RTC_DATE_StructInit(&lstDate);

    //lstDate.WeekDay = 6;
    lstDate.Day   = mDate.stDate.ui8Day;
    lstDate.Month = mDate.stDate.ui8Month;
    if (mDate.stDate.ui16Year > 2000)
    {
      lstDate.Year  = mDate.stDate.ui16Year - 2000;
    }
    else
    {
      lstDate.Year  = mDate.stDate.ui16Year;
    }


    LL_RTC_DATE_Init(RTC, LL_RTC_FORMAT_BIN, &lstDate);

    LL_RTC_TimeTypeDef lstTime;
    LL_RTC_TIME_StructInit(&lstTime);

    lstTime.TimeFormat = LL_RTC_TIME_FORMAT_AM_OR_24;
    lstTime.Hours   = mTime.stTime.ui8Hour;
    lstTime.Minutes = mTime.stTime.ui8Minute;
    lstTime.Seconds = mTime.stTime.ui8Second;
    LL_RTC_TIME_Init(RTC, LL_RTC_FORMAT_BIN, &lstTime);

    if (cBuRam::mBuRam->u32RtcSyncCnt < UINT32_MAX)
    {
      cBuRam::mBuRam->u32RtcSyncCnt++; // set valid
    }

    mLastSync.unDate.ui32Date = mDate.ui32Date;
    mLastSync.unTime.ui32Time = mTime.ui32Time;

    cBuRam::mBuRam->u32RtcSyncDate = mLastSync.unDate.ui32Date;
    cBuRam::mBuRam->u32RtcSyncTime = mLastSync.unTime.ui32Time;

    vSetSyncAttempt();

    mValid = 1;
  }

  void vReadFromRtc()
  {
    mTime.stTime.ui8SubSecond = 0;
    mTime.stTime.ui8Second = __LL_RTC_CONVERT_BCD2BIN(LL_RTC_TIME_GetSecond(RTC));
    mTime.stTime.ui8Minute = __LL_RTC_CONVERT_BCD2BIN(LL_RTC_TIME_GetMinute(RTC));
    mTime.stTime.ui8Hour   = __LL_RTC_CONVERT_BCD2BIN(LL_RTC_TIME_GetHour(RTC));

    mDate.stDate.ui8Day   = __LL_RTC_CONVERT_BCD2BIN(LL_RTC_DATE_GetDay(RTC));
    mDate.stDate.ui8Month = __LL_RTC_CONVERT_BCD2BIN(LL_RTC_DATE_GetMonth(RTC));
    mDate.stDate.ui16Year = __LL_RTC_CONVERT_BCD2BIN(LL_RTC_DATE_GetYear(RTC)) + 2000;
  }

  void vSet(u16 lu16Year, u8 lu8Month, u8 lu8Day, u8 lu8Hour, u8 lu8Min, u8 lu8Sec)
  {
    mTime.stTime.ui8SubSecond = 0;
    mTime.stTime.ui8Second    = lu8Sec;
    mTime.stTime.ui8Minute    = lu8Min;
    mTime.stTime.ui8Hour      = lu8Hour;

    mDate.stDate.ui8Day   = lu8Day;
    mDate.stDate.ui8Month = lu8Month;
    mDate.stDate.ui16Year = lu16Year;

    vWriteToRtc();
  }

  bool IsValid()
  {
    return (mValid == 1);
  }

  i32 i32DateToDays(tstDate* d)
  {
    i32 y   = d->ui16Year;
    i32 m   = d->ui8Month;
    i32 day = d->ui8Day;

    // Januar und Februar werden als Monate 13 und 14 des Vorjahres behandelt,
    // um die Schaltjahreslogik am Ende des Februar vereinfacht abzubilden.
    if (m <= 2)
    {
      y -= 1;
      m += 12;
    }

    // Formel berücksichtigt die 4, 100 und 400-Jahre-Schaltjahrregeln
    return 365 * y + y / 4 - y / 100 + y / 400 + (153 * (m + 1)) / 5 + day;
  }

  i32 i32DaysDiff(tstTimeDate lstFrom)
  {
    i32 li32Diff = (i32DateToDays(&lstFrom.unDate.stDate) - i32DateToDays(&mDate.stDate));

    if (li32Diff < 0) return -li32Diff;
    return li32Diff;
  }

  void vSetSyncAttempt()
  {
    mLastSyncAttempt.unDate.ui32Date = mDate.ui32Date;
    mLastSyncAttempt.unTime.ui32Time = mTime.ui32Time;

    cBuRam::mBuRam->u32RtcSyncAttmptDate = mLastSyncAttempt.unDate.ui32Date;
    cBuRam::mBuRam->u32RtcSyncAttmptTime = mLastSyncAttempt.unTime.ui32Time;
  }

  bool bResync(i32 li32DiffLastSync_d = 2, i32 li32DiffLastSyncAttempt_d = 1)
  {
    i32 li32DiffDays;

    // Es gab noch nie einen Versuch
    // Normal nur nach Reset, dann immer Sync anfordern
    if ((mLastSyncAttempt.unDate.ui32Date == 0) &&
        (mLastSyncAttempt.unTime.ui32Time == 0)) return 1;

    li32DiffDays = i32DaysDiff(mLastSyncAttempt);

    // Letzter Synv-Versuch mind. 1 Tag her
    if (li32DiffDays < 0) li32DiffDays = -li32DiffDays;
    if (li32DiffDays >= li32DiffLastSyncAttempt_d)
    {
      if (!IsValid()) return 1;

      li32DiffDays = i32DaysDiff(mLastSync);

      // Letzter Synv-Versuch mind. 2 Tage her
      if (li32DiffDays < 0) li32DiffDays = -li32DiffDays;
      if (li32DiffDays >= li32DiffLastSync_d) return 1;
    }
    return 0;
  }

  void vDecode32Bit(uint32 lui32TimeDate)
  {
    uint32 lui32Counts;
    uint32 lui32Counts1;

    mDate.stDate.ui16Year  = 1970 - 1;
    lui32Counts     = 0;
    lui32Counts1    = lui32Counts;

    // Remaining Year, Month, Day, Hour, Minute, Second
    while(lui32Counts < lui32TimeDate)
    {
      lui32Counts1 = lui32Counts;
      if(IsLeapYear(mDate.stDate.ui16Year))
      {
        lui32Counts += 31622400;
      }
      else
      {
        lui32Counts += 31536000;
      }
      mDate.stDate.ui16Year++;
    }

    lui32TimeDate -= lui32Counts1;
    lui32Counts    = 0;

    // Remaining Month, Day, Hour, Minute, Second
    mDate.stDate.ui8Month = 0;
    while(lui32Counts < lui32TimeDate)
    {
      lui32Counts1 = lui32Counts;
      lui32Counts += (((uint32)nMonthTable[mDate.stDate.ui8Month]) * 86400);

      if (mDate.stDate.ui8Month == 1) //February ?
      {
        if(IsLeapYear(mDate.stDate.ui16Year) == 1)
        {
          lui32Counts += 86400;
        }
      }

      mDate.stDate.ui8Month++;
    }

    lui32TimeDate -= lui32Counts1;

    // Remaining Day, Hour, Minute, Second
    mDate.stDate.ui8Day     = ((lui32TimeDate / 86400) + 1);
    lui32TimeDate -= (mDate.stDate.ui8Day - 1) * 86400;

    // Remaining Hour, Minute, Second
    mTime.stTime.ui8Hour    =  (lui32TimeDate / 3600);
    lui32TimeDate -= mTime.stTime.ui8Hour * 3600;

    // Remaining Minute, Second
    mTime.stTime.ui8Minute  =  (lui32TimeDate / 60);
    mTime.stTime.ui8Second  =  (lui32TimeDate % 60);

    vWriteToRtc();
  }

  void vAdd1s()
  {
    if (mValid) vReadFromRtc();

    // tSU(LSE)(3) Startup time VDD is stabilized: 2s
    // t SU(LSE) is the startup time measured from the moment it is enabled (by software) to a stabilized 32.768 kHz oscillation is
    // reached. This value is measured for a standard crystal and it can vary significantly with the crystal manufacturer
    //
    // Nachdem die Warte abgelaufen ist, überprüfen, ob auf LSE geschaltet werden kann.
    if (mu8WaitForLse_s)
    {
      if (LL_RCC_LSE_IsReady())
      {
        mu8WaitForLse_s = 0;
        vRtcInit2();
      }
      else
      {
        if (mu8WaitForLse_s > 1)
        {
          mu8WaitForLse_s--;
        }
        else
        {
          mu8WaitForLse_s = 0;
          vRtcInit2();
        }
      }
    }
  }

  void vAdd(cClock &lcClock)
  {
    vReadFromRtc();
    mTime.stTime.ui8Second += lcClock.mTime.stTime.ui8Second;
    if (mTime.stTime.ui8Second >= 60)
    {
      mTime.stTime.ui8Second %= 60;
      mTime.stTime.ui8Minute++;
    }

    mTime.stTime.ui8Minute += lcClock.mTime.stTime.ui8Minute;
    if (mTime.stTime.ui8Minute >= 60)
    {
      mTime.stTime.ui8Minute %= 60;
      mTime.stTime.ui8Hour++;
    }

    mTime.stTime.ui8Hour += lcClock.mTime.stTime.ui8Hour;
    if (mTime.stTime.ui8Hour >= 24)
    {
      mTime.stTime.ui8Hour %= 24;
      mDate.stDate.ui8Day++;
    }

    mDate.stDate.ui8Day += lcClock.mDate.stDate.ui8Day;
    u8 lu8DayPerMonth = u8GetDayPerMonth(mDate.stDate.ui8Day, mDate.stDate.ui8Month);
    if (mDate.stDate.ui8Day >= lu8DayPerMonth)
    {
      mDate.stDate.ui8Day %= lu8DayPerMonth;
      mDate.stDate.ui8Month++;
    }

    mDate.stDate.ui8Month += lcClock.mDate.stDate.ui8Month;
    if (mDate.stDate.ui8Month >= 12)
    {
      mDate.stDate.ui8Month %= 12;
      mDate.stDate.ui16Year++;
    }

    mDate.stDate.ui16Year += lcClock.mDate.stDate.ui16Year;

    vWriteToRtc();
  }

  uint32 u32Encode32Bit()
  {
    uint32 lui32i;
    uint32 lui32Counts;

    vReadFromRtc();

    if(mDate.stDate.ui16Year > 2099)
    {
      mDate.stDate.ui16Year = 2099;
    }

    if(mDate.stDate.ui16Year < 1970)
    {
      mDate.stDate.ui16Year = 1970;
    }

    lui32Counts = 0;

    for(lui32i = 1970; lui32i < mDate.stDate.ui16Year; lui32i++)
    {
      if(IsLeapYear(lui32i))
      {
        lui32Counts += 31622400;
      }
      else
      {
        lui32Counts += 31536000;
      }
    }

    for(lui32i = 0; lui32i < (u32)(mDate.stDate.ui8Month - 1); lui32i++)
    {
      lui32Counts += (((uint32)nMonthTable[lui32i]) * 86400);
    }

    if (mDate.stDate.ui8Month > 2)
    {
      if(IsLeapYear(mDate.stDate.ui16Year) == 1)
      {
        lui32Counts += 86400;
      }
    }

    lui32Counts += ((uint32)(mDate.stDate.ui8Day - 1) * 86400);
    lui32Counts += ((uint32)mTime.stTime.ui8Hour      *  3600);
    lui32Counts += ((uint32)mTime.stTime.ui8Minute    *    60);
    lui32Counts += mTime.stTime.ui8Second;

    return lui32Counts;
  }


  u8 u8GetDayPerMonth(u8 lu8Month, u16 lu16Year)
  {
    //Februar ?
    if (lu8Month == 2)
    {
      if (IsLeapYear(lu16Year))
      {
        return 29;
      }
    }
    return nMonthTable[lu8Month - 1];
  }


  bool IsLeapYear(uint16 lui16Year)
  {
    if(lui16Year % 4 == 0)
    {
      if(lui16Year % 100 == 0)
      {
        if(lui16Year % 400 == 0)
        {
          return True;
        }
        else
        {
          return False;
        }
      }
      else
      {
        return True;
      }
    }
    return False;
  }

  u8* vSerialize(u8* lpu8Data)
  {
    vReadFromRtc();
    *lpu8Data++ = mDate.stDate.ui16Year >> 8;
    *lpu8Data++ = mDate.stDate.ui16Year & 0xFF;
    *lpu8Data++ = mDate.stDate.ui8Month;
    *lpu8Data++ = mDate.stDate.ui8Day;
    *lpu8Data++ = mTime.stTime.ui8Hour;
    *lpu8Data++ = mTime.stTime.ui8Minute;
    *lpu8Data++ = mTime.stTime.ui8Second;
    return lpu8Data;
  }

  u8* vDeserialize(u8* lpu8Data)
  {
    tstTime lstTime;
    tstDate lstDate;

    lstDate.ui16Year     = *lpu8Data++;
    lstDate.ui16Year     = (lstDate.ui16Year << 8) + *lpu8Data++;
    lstDate.ui8Month     = *lpu8Data++;
    lstDate.ui8Day       = *lpu8Data++;
    lstTime.ui8Hour      = *lpu8Data++;
    lstTime.ui8Minute    = *lpu8Data++;
    lstTime.ui8Second    = *lpu8Data++;
    lstTime.ui8SubSecond = 0;

    if ((lstDate.ui8Month  >= 1) && (lstDate.ui8Month  <= 12) &&
        (lstDate.ui8Day    >= 1) && (lstDate.ui8Day    <= 31) &&
                                    (lstTime.ui8Hour   <= 24) &&
                                    (lstTime.ui8Minute <= 60) &&
                                    (lstTime.ui8Second <= 60)
       )
    {
      mDate.stDate = lstDate;
      mTime.stTime = lstTime;


      vWriteToRtc();
    }

    return lpu8Data;
  }


  u8* vSerializeLastSync(u8* lpu8Data)
  {
    *lpu8Data++ = mLastSync.unDate.stDate.ui16Year >> 8;
    *lpu8Data++ = mLastSync.unDate.stDate.ui16Year & 0xFF;
    *lpu8Data++ = mLastSync.unDate.stDate.ui8Month;
    *lpu8Data++ = mLastSync.unDate.stDate.ui8Day;
    *lpu8Data++ = mLastSync.unTime.stTime.ui8Hour;
    *lpu8Data++ = mLastSync.unTime.stTime.ui8Minute;
    *lpu8Data++ = mLastSync.unTime.stTime.ui8Second;
    return lpu8Data;
  }


  cStr& toStringTime(cStr& lcStr)
  {
    vReadFromRtc();
    lcStr.Setf((const char8*)"%02d:%02d:%02d", mTime.stTime.ui8Hour, mTime.stTime.ui8Minute, mTime.stTime.ui8Second);
    return lcStr;
  }

  cStr& toStringDate(cStr& lcStr)
  {
    vReadFromRtc();
    lcStr.Setf((const char8*)"%04d-%02d-%02d", mDate.stDate.ui16Year, mDate.stDate.ui8Month, mDate.stDate.ui8Day);
    return lcStr;
  }

  cStr& toString(cStr& lcStr)
  {
    // 123456789012345678901
    // 2020-10-10 10:10:19 -/I/E
    vReadFromRtc();
    lcStr.Setf((const char8*)"%04d-%02d-%02d %02d:%02d:%02d ", mDate.stDate.ui16Year, mDate.stDate.ui8Month,  mDate.stDate.ui8Day,
                                                               mTime.stTime.ui8Hour,  mTime.stTime.ui8Minute, mTime.stTime.ui8Second);

    switch (mu8ClockSource)
    {
      case 1:  lcStr += (rsz)"LSE"; break;
      case 2:  lcStr += (rsz)"LSI"; break;
      case 3:  lcStr += (rsz)"HSE"; break;
      default: lcStr += (rsz)"---"; break;
    }

    return lcStr;
  }
};

#ifdef __cplusplus
}
#endif

#endif /* _CCLOCK_H */
